<script>
    import BreadCrumbs from "$lib/components/global/BreadCrumbs.svelte";
    export let data;
</script>

<svelte:head>
    {#if data.locale === 'uk'}
        <title>Політика конфіденційності - Авто Ділер</title>
    {:else}
        <title>Политика конфиденциальности - Авто Ділер</title>
    {/if}
    <meta property="og:type" content="website">
    <meta property="og:site_name" content="Авто Ділер">
</svelte:head>


{#if data.locale === 'uk'}
    <BreadCrumbs items={{id: 2, parents: []}} currentPage="Політика конфіденційності" />
{:else}
    <BreadCrumbs items={{id: 2, parents: []}} currentPage="Политика конфиденциальности" />
{/if}

<main class="post">
    <div class="container">
        <div class="content-wrapper">
            <div class="text-content">
                {#if data.locale === 'uk'}
                    <h1>Політика конфіденційності</h1>
                    <p>
                        Ця політика конфіденційності пояснює, як сайт Avtodiler.com.ua (далі – «Сайт») збирає, використовує та захищає інформацію користувачів. Використовуючи наш сайт, ви погоджуєтесь із цією політикою.
                    </p>
                    <h2>
                        Яку інформацію ми збираємо?
                    </h2>
                    <p>
                        Ми можемо збирати такі види персональних даних:
                    </p>
                    <ul>
                        <li>Ім’я, прізвище</li>
                        <li>Контактні дані (номер телефону, електронна пошта)</li>
                        <li>Адресу доставки</li>
                        <li>Дані про використання сайту (cookies, IP-адресу, дані про пристрій)</li>
                    </ul>
                    <h2>
                        Як ми використовуємо вашу інформацію?
                    </h2>
                    <p>
                        Зібрана інформація використовується для:
                    </p>
                    <ul>
                        <li>Обробки та виконання замовлень</li>
                        <li>Поліпшення якості обслуговування</li>
                        <li>Надсилання рекламних та інформаційних матеріалів (за згодою користувача)</li>
                        <li>Аналізу роботи сайту та персоналізації контенту</li>
                    </ul>
                    <h2>
                        Захист даних
                    </h2>
                    <p>
                        Ми використовуємо сучасні технічні засоби для забезпечення безпеки персональних даних. Доступ до інформації мають лише уповноважені співробітники.
                    </p>
                    <h2>
                        Чи передаємо ми дані третім особам?
                    </h2>
                    <p>
                        Ми не продаємо та не передаємо особисті дані третім особам, за винятком випадків, коли це необхідно для виконання замовлення (служби доставки, платіжні системи) або на вимогу законодавства.
                    </p>
                    <h2>
                        Файли cookie
                    </h2>
                    <p>
                        Наш сайт використовує файли cookie для поліпшення роботи сайту. Ви можете налаштувати використання файлів cookie у своєму браузері.
                    </p>
                    <h2>
                        Ваші права
                    </h2>
                    <p>
                        Користувач має право:
                    </p>
                    <ul>
                        <li>Дізнатися, які дані про нього зберігаються</li>
                        <li>Вимагати виправлення або видалення своїх даних</li>
                        <li>Відмовитися від отримання рекламних повідомлень</li>
                    </ul>
                    <h2>
                        Зв’язок
                    </h2>
                    <p>
                        Якщо у вас є запитання щодо політики конфіденційності, зв’яжіться з нами за електронною поштою lebed@image-avto.com.ua або телефоном +38 (050) 767-39-80.
                    </p>
                    <p>
                        Ця політика конфіденційності може змінюватися. Оновлену версію завжди можна знайти на цій сторінці.
                    </p>
                {:else}
                    <h1>Политика конфиденциальности</h1>
                    <p>
                        Эта политика конфиденциальности объясняет, как сайт Avtodiler.com.ua (далее – «Сайт») собирает, использует и защищает информацию пользователей. Используя наш сайт, вы соглашаетесь с этой политикой.
                    </p>
                    <h2>
                        Какую информацию мы собираем?
                    </h2>
                    <p>
                        Мы можем собирать следующие виды персональных данных:
                    </p>
                    <ul>
                        <li>Имя, фамилия</li>
                        <li>Контактные данные (номер телефона, электронная почта)</li>
                        <li>Адрес доставки</li>
                        <li>Данные об использовании сайта (cookies, IP-адрес, данные о устройстве)</li>
                    </ul>
                    <h2>
                        Как мы используем вашу информацию?
                    </h2>
                    <p>
                        Собранная информация используется для:
                    </p>
                    <ul>
                        <li>Обработки и выполнения заказов</li>
                        <li>Улучшения качества обслуживания</li>
                        <li>Отправки рекламных и информационных материалов (с согласия пользователя)</li>
                        <li>Анализа работы сайта и персонализации контента</li>
                    </ul>
                    <h2>
                        Защита данных
                    </h2>
                    <p>
                        Мы используем современные технические средства для обеспечения безопасности персональных данных. Доступ к информации имеют только уполномоченные сотрудники.
                    </p>
                    <h2>
                        Передача данных третьим лицам
                    </h2>
                    <p>
                        Мы не продаем и не передаем личные данные третьим лицам, за исключением случаев, когда это необходимо для выполнения заказа (службы доставки, платежные системы) или по требованию законодательства.
                    </p>
                    <h2>
                        Файлы cookie
                    </h2>
                    <p>
                        Наш сайт использует файлы cookie для улучшения работы сайта. Вы можете настроить использование файлов cookie в своем браузере.
                    </p>
                    <h2>
                        Ваши права
                    </h2>
                    <p>
                        Пользователь имеет право:
                    </p>
                    <ul>
                        <li>Узнать, какие данные о нем хранятся</li>
                        <li>Требовать исправления или удаления своих данных</li>
                        <li>Отказаться от получения рекламных сообщений</li>
                    </ul>
                    <h2>
                        Контакты
                    </h2>
                    <p>
                        Если у вас есть вопросы относительно политики конфиденциальности, свяжитесь с нами по электронной почте lebed@image-avto.com.ua или телефону +38 (050) 767-39-80.
                    </p>
                    <p>
                        Эта политика конфиденциальности может изменяться. Актуальную версию всегда можно найти на этой странице.
                    </p>
                {/if}
            </div>
        </div>
    </div>
</main>

<style>
    .post {
        padding-bottom: var(--padding-section);
    }
    .content-wrapper {
        max-width: 69rem;
        margin: 0 auto;
    }
</style>