<script>
    import BreadCrumbs from "$lib/components/global/BreadCrumbs.svelte";
    export let data;
</script>

<svelte:head>
    {#if data.locale === 'uk'}
        <title>Обмін і повернення - Авто Ділер</title>
    {:else}
        <title>Обмен и возврат - Авто Ділер</title>
    {/if}
    <meta property="og:type" content="website">
    <meta property="og:site_name" content="Авто Ділер">
</svelte:head>


{#if data.locale === 'uk'}
    <BreadCrumbs items={{id: 2, parents: []}} currentPage="Обмін і повернення" />
{:else}
    <BreadCrumbs items={{id: 2, parents: []}} currentPage="Обмен и возврат" />
{/if}

<main class="post">
    <div class="container">
        <div class="content-wrapper">
            <div class="text-content">
                {#if data.locale === 'uk'}
                    <h1>Обмін і повернення</h1>
                    <p>
                        Ми прагнемо забезпечити наших клієнтів якісними автозапчастинами. Якщо товар вам не підійшов або виявився бракованим, ви можете оформити його обмін або повернення відповідно до наших умов.
                    </p>
                    <h2>
                        Термін повернення
                    </h2>
                    <p>
                        Повернення або обмін товару можливе протягом <strong>14 днів</strong> з моменту отримання замовлення.
                    </p>
                    <h2>
                        Умови обміну та повернення
                    </h2>
                    <p>
                        Товар можна повернути або обміняти, якщо:
                    </p>
                    <ul>
                        <li>Він не був у вжитку та не має слідів експлуатації.</li>
                        <li>Збережено оригінальну упаковку, пломби, ярлики та комплектність.</li>
                        <li>Є документ, що підтверджує покупку (чек, накладна).</li>
                        <li>Товар не входить до списку запчастин, що не підлягають поверненню (електронні компоненти, деталі під замовлення тощо).</li>
                    </ul>
                    <p>
                        Якщо товар має заводський брак або не відповідає замовленому, обмін або повернення здійснюється безкоштовно.
                    </p>
                    <h2>
                        Як оформити обмін або повернення?
                    </h2>
                    <ol>
                        <li><strong>Зв’яжіться з нами</strong> – напишіть на нашу електронну пошту lebed@image-avto.com.ua або зателефонуйте за номером <strong>+38 (099) 079-17-64</strong></li>
                        <li><strong>Вкажіть номер замовлення</strong>, причину повернення та додайте фото товару (за необхідності).</li>
                        <li><strong>Упакуйте товар</strong> – товар слід ретельно запакувати в оригінальну упаковку та додати супровідні документи.</li>
                        <li><strong>Відправте товар</strong> – надішліть його за адресою: <strong>м. Харків, пров. Степовий, 43</strong>. При відправці через службу доставки збережіть квитанцію.</li>
                    </ol>
                    <h2>
                        Хто оплачує доставку?
                    </h2>
                    <ul>
                        <li>Якщо повернення здійснюється через помилку <strong>з нашого боку</strong> (неправильна деталь, заводський брак) – ми компенсуємо вартість зворотної доставки.</li>
                        <li>Якщо повернення <strong>з ініціативи клієнта</strong> (не підійшов розмір, помилилися з вибором) – транспортні витрати оплачує покупець.</li>
                    </ul>
                    <h2>
                        Термін та спосіб повернення коштів
                    </h2>
                    <p>Після отримання та перевірки товару повернення коштів здійснюється протягом <strong>3-5 робочих днів</strong>. Гроші повертаються тим же способом, яким було здійснено оплату:</p>
                    <ul>
                        <li>на банківську картку,</li>
                        <li>на рахунок електронного гаманця,</li>
                        <li>готівкою (за домовленістю).</li>
                    </ul>
                    <p>
                        Якщо у вас залишилися питання, звертайтеся до нашої служби підтримки – ми завжди раді допомогти!
                    </p>
                {:else}
                    <h1>Обмен и возврат</h1>
                    <p>
                        Мы стремимся обеспечить наших клиентов качественными автозапчастями. Если товар вам не подошел или оказался бракованным, вы можете оформить его обмен или возврат в соответствии с нашими условиями.
                    </p>
                    <h2>
                        Срок возврата
                    </h2>
                    <p>
                        Возврат или обмен товара возможен в течение <strong>14 дней</strong> с момента получения заказа.
                    </p>
                    <h2>
                        Условия обмена и возврата
                    </h2>
                    <p>
                        Товар можно вернуть или обменять, если:
                    </p>
                    <ul>
                        <li>Он не был в использовании и не имеет следов эксплуатации.</li>
                        <li>Сохранена оригинальная упаковка, пломбы, ярлыки и комплектность.</li>
                        <li>Есть документ, подтверждающий покупку (чек, накладная).</li>
                        <li>Товар не входит в список запчастей, не подлежащих возврату (электронные компоненты, детали под заказ и т. д.).</li>
                    </ul>
                    <h2>
                        Как оформить обмен или возврат?
                    </h2>
                    <ol>
                        <li><strong>Свяжитесь с нами</strong> – напишите на нашу электронную почту lebed@image-avto.com.ua или позвоните по номеру <strong>+38 (099) 079-17-64</strong>.</li>
                        <li><strong>Укажите данные</strong> – сообщите номер заказа, причину возврата и добавьте фото товара (при необходимости).</li>
                        <li><strong>Упакуйте товар</strong> – тщательно упакуйте товар в оригинальную упаковку и добавьте сопроводительные документы.</li>
                        <li><strong>Отправьте товар</strong> – отправьте его по адресу: <strong>г. Харьков, пер. Степной, 43</strong>. При отправке через службу доставки сохраните квитанцию.</li>
                    </ol>
                    <h2>
                        Кто оплачивает доставку?
                    </h2>
                    <ul>
                        <li>Если возврат осуществляется <strong>по нашей ошибке</strong> (неправильная деталь, заводской брак) – мы компенсируем стоимость обратной доставки.</li>
                        <li>Если возврат по <strong>инициативе клиента</strong> (не подошел размер, ошибка в выборе) – транспортные расходы оплачивает покупатель.</li>
                    </ul>
                    <h2>
                        Срок и способ возврата средств
                    </h2>
                    <p>После получения и проверки товара возврат средств осуществляется в течение <strong>3-5 рабочих</strong> дней. Деньги возвращаются тем же способом, которым была произведена оплата:</p>
                    <ul>
                        <li>на банковскую карту,</li>
                        <li>на счет электронного кошелька,</li>
                        <li>наличными (по договоренности).</li>
                    </ul>
                    <p>
                        Если у вас остались вопросы, обращайтесь в нашу службу поддержки – мы всегда рады помочь!
                    </p>
                {/if}
            </div>
        </div>
    </div>
</main>

<style>
    .post {
        padding-bottom: var(--padding-section);
    }
    .content-wrapper {
        max-width: 69rem;
        margin: 0 auto;
    }
</style>