<script>
    import BreadCrumbs from "$lib/components/global/BreadCrumbs.svelte";
    export let data;
</script>

<svelte:head>
    {#if data.locale === 'uk'}
        <title>Публічна оферта - Авто Ділер</title>
    {:else}
        <title>Публичное предложение - Авто Ділер</title>
    {/if}
    <meta property="og:type" content="website">
    <meta property="og:site_name" content="Авто Ділер">
</svelte:head>


{#if data.locale === 'uk'}
    <BreadCrumbs items={{id: 2, parents: []}} currentPage="Публічна оферта" />
{:else}
    <BreadCrumbs items={{id: 2, parents: []}} currentPage="Публичное предложение" />
{/if}

<main class="post">
    <div class="container">
        <div class="content-wrapper">
            <div class="text-content">
                {#if data.locale === 'uk'}
                    <h1>ПУБЛІЧНА ОФЕРТА</h1>
                    <p>Цей документ є офіційною пропозицією (публічною офертою) інтернет-магазину Avtodiler, розміщеного за адресою https://www.avtodiler.com.ua/uk, укласти договір купівлі-продажу товарів дистанційним способом.</p>
                    <h2>1. Загальні положення</h2>
                    <p>1.1. Дана Публічна оферта визначає умови купівлі-продажу автозапчастин через інтернет-магазин Avtodiler. 1.2. Прийняття (акцепт) цієї оферти відбувається шляхом оформлення замовлення на сайті, що вважається рівнозначним підписанню письмового договору. 1.3. Покупцем може бути будь-яка фізична або юридична особа, яка прийняла умови цієї оферти.</p>
                    <h2>2. Предмет договору</h2>
                    <p>2.1. Продавець зобов’язується передати Покупцеві автозапчастини, а Покупець – прийняти їх і оплатити на умовах, визначених у цій оферті. 2.2. Найменування, асортимент, кількість та ціна товарів визначаються у замовленні Покупця.</p>
                    <h2>3. Оформлення замовлення</h2>
                    <p>3.1. Покупець самостійно оформлює замовлення на сайті, обираючи необхідні товари. 3.2. Після оформлення замовлення Продавець зв’язується з Покупцем для підтвердження деталей. 3.3. Продавець залишає за собою право відмовити в обробці замовлення у разі відсутності товару на складі або з інших об’єктивних причин.</p>
                    <h2>4. Оплата</h2>
                    <p>4.1. Оплата здійснюється відповідно до варіантів, вказаних на сайті (банківський переказ, оплата карткою, післяплата тощо). 4.2. Ціна товару вказується в національній валюті України – гривні.</p>
                    <h2>5. Доставка</h2>
                    <p>5.1. Доставка здійснюється перевізниками відповідно до обраного Покупцем варіанту. 5.2. Витрати на доставку оплачуються Покупцем, якщо інше не передбачено умовами акцій чи спеціальних пропозицій.</p>
                    <h2>6. Повернення та гарантії</h2>
                    <p>6.1. Покупець має право повернути товар відповідно до чинного законодавства України. 6.2. Гарантія на товари надається згідно з умовами виробника.</p>
                    <h2>7. Відповідальність сторін</h2>
                    <p>7.1. Продавець не несе відповідальності за некоректне використання товару Покупцем. 7.2. У разі форс-мажорних обставин Продавець має право відмовити в виконанні зобов’язань без нарахування штрафних санкцій.</p>
                    <h2>8. Заключні положення</h2>
                    <p>8.1. Продавець залишає за собою право змінювати умови цієї оферти без попереднього повідомлення. 8.2. Актуальна редакція оферти завжди доступна на сайті Продавця.</p>
                    <p>Контактна інформація: Інтернет-магазин Avtodiler Сайт: https://www.avtodiler.com.ua/ ФОП Дідик Володимир Андрійович</p>
                    <p>Юридична інформація:</p>
                    <p>Повна назва: Фізична особа підприємець Дідик Володимир Андрійович</p>
                    <p>Місцезнаходження: 64201, М.БАЛАКЛІЯ, ВУЛ.ЦЕМЕНТНИКІВ БУД.11</p>
                    <p>РНОКПП: 3783706478</p>
                    <p>IBAN: UA303052990000026001005906736</p>
                    <p>Номер телефону підписанта: 380501327712</p>
                    <p>Графік роботи: ПН-ПТ 9:00-18:00, СБ 9:00-15:00</p>
                    <p>Email: oskurtu@image-avto.com.ua</p>
                {:else}
                    <h1>ПУБЛИЧНАЯ ОФЕРТА</h1>
                    <p>Этот документ является официальным предложением (публичной офертой) интернет-магазина Avtodiler, размещенного по адресу https://www.avtodiler.com.ua/ru, заключить договор купли-продажи товаров дистанционным способом.</p>
                    <h2>1. Общие положения</h2>
                    <p>1.1. Данная Публичная оферта определяет условия купли-продажи автозапчастей через интернет-магазин Avtodiler. 1.2. Принятие (акцепт) этой оферты происходит путем оформления заказа на сайте, что считается равнозначным подписанию письменного договора. 1.3. Покупателем может быть любое физическое или юридическое лицо, принявшее условия этой оферты.</p>
                    <h2>2. Предмет договора</h2>
                    <p>2.1. Продавец обязуется передать Покупателю автозапчасти, а Покупатель – принять их и оплатить на условиях, определенных в этой оферте. 2.2. Наименование, ассортимент, количество и цена товаров определяются в заказе Покупателя.</p>
                    <h2>3. Оформление заказа</h2>
                    <p>3.1. Покупатель самостоятельно оформляет заказ на сайте, выбирая необходимые товары. 3.2. После оформления заказа Продавец связывается с Покупателем для подтверждения деталей. 3.3. Продавец оставляет за собой право отказать в обработке заказа в случае отсутствия товара на складе или по другим объективным причинам.</p>
                    <h2>4. Оплата</h2>
                    <p>4.1. Оплата осуществляется в соответствии с вариантами, указанными на сайте (банковский перевод, оплата картой, наложенный платеж и т. д.). 4.2. Цена товара указывается в национальной валюте Украины – гривне.</p>
                    <h2>5. Доставка</h2>
                    <p>5.1. Доставка осуществляется перевозчиками в соответствии с выбранным Покупателем вариантом. 5.2. Расходы на доставку оплачиваются Покупателем, если иное не предусмотрено условиями акций или специальных предложений.</p>
                    <h2>6. Возврат и гарантии</h2>
                    <p>6.1. Покупатель имеет право вернуть товар в соответствии с действующим законодательством Украины. 6.2. Гарантия на товары предоставляется согласно условиям производителя.</p>
                    <h2>7. Ответственность сторон</h2>
                    <p>7.1. Продавец не несет ответственности за некорректное использование товара Покупателем. 7.2. В случае форс-мажорных обстоятельств Продавец имеет право отказаться от выполнения обязательств без начисления штрафных санкций.</p>
                    <h2>8. Заключительные положения</h2>
                    <p>8.1. Продавец оставляет за собой право изменять условия этой оферты без предварительного уведомления. 8.2. Актуальная редакция оферты всегда доступна на сайте Продавца.</p>
                    <p>Контактная информация: Интернет-магазин Avtodiler Сайт: https://www.avtodiler.com.ua/ ФЛП Дидик Владимир Андреевич</p>
                    <p>Юридическая информация:</p>
                    <p>Полное наименование: Физическое лицо-предприниматель Дидык Владимир Андреевич</p>
                    <p>Местонахождение: 64201, г. БАЛАКЛЕЯ, ул. ЦЕМЕНТНИКОВ, д. 11</p>
                    <p>РНОКПП: 3783706478</p>
                    <p>IBAN: UA303052990000026001005906736</p>
                    <p>Номер телефона подписанта: 380501327712</p>
                    <p>График работы: ПН-ПТ 9:00-18:00, СБ 9:00-15:00</p>
                    <p>Email: oskurtu@image-avto.com.ua</p>
                {/if}
            </div>
        </div>
    </div>
</main>

<style>
    .post {
        padding-bottom: var(--padding-section);
    }
    .content-wrapper {
        max-width: 69rem;
        margin: 0 auto;
    }
</style>